Core/src/DataProcessors/ЗагрузкаСпискаНоменклатурыРасширенная/ЗагрузкаСпискаНоменклатурыРасширенная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСпискаНоменклатурыРасширенная</name>
  <attributes>
    <name>АдресВременногоХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВременногоФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляЗагрузкиНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборСвойств</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/Enums/МетодОценкиЗапасов/МетодОценкиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодОценкиЗапасов</name>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>FIFO</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Оптовая</name>
      <description>საბითუმო ფასი</description>
    </items>
    <items>
      <name>Учетная</name>
      <description>საცალო ფასი</description>
    </items>
  </predefined>
  <attributes>
    <name>ВалютаЦены</name>
    <comment>Валюта цены</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>Истина - цена включает НДС, ложь - не включает</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <comment>Порядок округления</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <comment>Истина, то при порядке округления &quot;5&quot; 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЦены</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРассчитываетсяДинамически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВидаЦен</name>
    <type>
      <types>EnumRef.ТипыВидовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦеныАктуальны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокСлужебный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииНоменклатуры</name>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/DataProcessors/ЗагрузкаСпискаНоменклатурыРасширенная/Forms/Форма/Module.bsl
//Паганини_
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НоменклатурнаяГруппа = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КатегорииНоменклатуры", "БезКатегории");
	Объект.ЕдиницаИзмерения	    = УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КлассификаторЕдиницИзмерения", "шт");
	Объект.СтавкаНДС			= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("СтавкиНДС", "НДС18");
	Объект.СчетУчетаЗапасов		= ПланыСчетов.Управленческий.СырьеИМатериалы;
	Объект.СчетУчетаЗапасовРегл	= ПланыСчетов.Хозрасчетный.Товары;
	Объект.СчетУчетаЗатрат		= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Объект.СчетУчетаЗатратРегл	= РегламентированныйУчетСервер.ПолучитьСчетПоНомеру("1630");
	Объект.МетодОценки			= Перечисления.МетодОценкиЗапасов.ПоСредней;
	Объект.ВидЦен				= Справочники.ВидыЦен.Учетная;
КонецПроцедуры
//_Паганини

//////////////////////////////////////////////////////
// Работа с файлом для загрузки
//

&НаКлиенте
Процедура ВыбратьФайл(Интерактивно)
	Объект.АдресВременногоХранилища = "";
	Если ПоместитьФайл(Объект.АдресВременногоХранилища, Объект.ИмяФайлаДанных, ПутьКФайлу, Интерактивно, УникальныйИдентификатор) Тогда		
		Объект.ИмяФайлаДанных = ПутьКФайлу;
		ПолучитьСтраницыФайла();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Паганини_
	ВыбратьФайл(Истина);
	//Режим = РежимДиалогаВыбораФайла.Открытие;
	//ДиалогВыбораФайла = Новый ДиалогВыбораФайла(Режим);
	//ДиалогВыбораФайла.ПолноеИмяФайла = Элемент.ТекстРедактирования;
	//ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	//ДиалогВыбораФайла.Заголовок = "Выберите файл заявки";
	//
	//ДиалогВыбораФайла.Фильтр = "(*.xlsx;*.xls)|*.xlsx;*.xls|";
	//Если ДиалогВыбораФайла.Выбрать() Тогда
	//	ПутьКФайлу = ДиалогВыбораФайла.ВыбранныеФайлы[0];
	//	Объект.АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
	//	Объект.ИмяФайлаДанных = ПутьКФайлу;
	//	ПолучитьСтраницыФайла();
	//Иначе
	//	Предупреждение("Файл не выбран!");
	//	ТекущийЭлемент = Элементы.ПутьКФайлу;
	//КонецЕсли;
	//_Паганини
КонецПроцедуры




&НаСервере
Процедура ПолучитьСтраницыФайла()
	СтраницыИзФайла.Очистить();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Таблица = ОбработкаОбъект.ПолучитьПереченьСтраниц(СтраницыИзФайла);
КонецПроцедуры


//////////////////////////////////////////////////////
// Обработка данных
//

&НаКлиенте
Процедура ОбработкаДанных(Команда)
		
	//Паганини_
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	//_Паганини
	ОбработкаДанныхСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаДанныхСервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.ОбработкаДанныхИзФайла(СтраницыИзФайла);
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьШаблонФайла(Команда)
	АдресХранилища = ПоместитьВоВременноеХранилище("", ЭтаФорма.УникальныйИдентификатор);
	ВерсияФорматаФайла = СгенерироватьШаблонФайлаСервер(АдресХранилища);
	ПолучитьФайл(АдресХранилища,"шаблон.xls" + ?(ВерсияФорматаФайла < 13, "", "x"), Истина);
КонецПроцедуры

&НаСервере
Функция СгенерироватьШаблонФайлаСервер(АдресХранилища)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Резлультат = ОбработкаОбъект.СгенерироватьШаблонДляФайлаИмпорта(АдресХранилища);
	
Возврат Резлультат;
КонецФункции
